


label CR2_AS2_rep:
    $ renpy.music.stop(channel="music2", fadeout=1)
    $ renpy.music.play('/sfx/Deadly_Roulette.mp3', channel="music1", loop=True, fadein = 2)
    hide screen week_day_viewer
    hide screen time_skip_button
    hide screen day_time_viewer
    hide screen map_button
    scene CR2_AS2_p1 with dissolve
    $ can_hide_windows = True
    MC "Это была довольно забавная фотосессия!"
    Caroline "Да, мне тоже понравилось! Даже если костюм был немного ... непристойный."
    MC "Итак, учитывая, насколько ты выглядела сексуально, я ДЕЙСТВИТЕЛЬНО нуждаюсь в том, чтобы пользоваться той сделкой, которую мы заключили."
    $ renpy.music.stop(channel="music1", fadeout=1)
    $ renpy.music.play('/sfx/Miami Viceroy.mp3', channel="music2", loop=True, fadein = 2)
    scene CR2_AS2_p2

    Caroline "Ой? И как бы ты хотел ее использовать?"
    MC "Я думаю, что ты можешь использовать эту удивительную задницу, чтобы выручить меня."
    MC "Что ты сказал?"


    scene CR2_AS2_p3

    MC "(Святое дерьмо, эти соски сосков потрясающие!)"
    MC "(Я бы хотел, чтобы она меня обманула, но я чувствую, что сейчас использую ее задницу.)"
    Caroline "Ты не имеешь в виду ... внутри?"


    scene CR2_AS2_p4

    MC "Нет! Конечно нет. Прямо между твоими булками."
    Caroline "Я ... э-э ... я думаю, это нормально."
    MC "Потрясающе!"


    scene CR2_AS2_p5

    Caroline "Что ты хочешь чтобы я сделала?"
    MC "А если ты просто ляжешь лицом вниз на диван?"
    MC "Я могу достать это оттуда."
    Caroline "Тогда ладно."

    scene CR2_AS2_p6

    Caroline "Именно так?"
    MC "Это абсолютно идеально!"
    Caroline "И ты обещаешь, что не войдешь внутрь?"
    MC "Твои трусики останутся на месте - не беспокойся."

    scene CR2_AS2_p7

    MC "(Хотя, если быть абсолютно честным, эти трусики настолько плотно прилягают, что я едва вижу их!)"
    MC "(С этой точки зрения она может вообще их не носить!)"
    Caroline "Скажи мне, прежде чем начнешь."

    scene CR2_AS2_p8

    MC "Хорошо, моя любимая. Я просто положу свой член."
    Caroline "Можешь не называть меня «моя любовь», когда мы это делаем?"
    Caroline "Мне это немного ... неудобно."

    scene CR2_AS2_p9

    MC "Извини, Кэролайн. Виноват."
    MC "Хорошо, я собираюсь толкать свой член между твоими ягодицами."
    scene CR2_AS2_p9anim
    Caroline "Ммм хм, хорошо."

    scene CR2_AS2_p10

    Caroline "Тебе хорошо?"
    MC "It’s not too bad."
    Caroline "Ты можешь ... ты можешь погрузить его глубже, если хочешь."

    scene CR2_AS2_p11

    MC "Потрясающе! Спасибо, моя... Кэролайн!"
    MC "(Это будет намного лучше!)"
    MC "(У Кэролайн такая пухленькая попка - я буду чувствовать себя потрясающе, когда они обернут обе стороны моего члена!)"

    scene CR2_AS2_p12

    MC "Уоххх…"
    scene CR2_AS2_p12anim
    Caroline "Приятно?"
    MC "О, да это прекрасно!"

    scene CR2_AS2_p13

    Caroline "Приятно? Действительно?"
    MC "Да, твое тело удивительно!"
    Caroline "(Он думает, что мое тело потрясающе! Хехе!)"

    scene CR2_AS2_p14

    MC "Mмм! Aхх..."
    scene CR2_AS2_p14anim
    Caroline "(Кажется, он наслаждался этим!)"
    Caroline "(Я никогда не думала, что парень может получить столько удовольствия, даже не проникая!)"

    scene CR2_AS2_p15

    MC "Ебать ... Это хорошо…"
    MC "Mмм…"
    MC "(Я собираюсь кончить! Ее задница прекрасно прижимается к моему члену!)"

    scene CR2_AS2_p16

    Caroline "Итак, куда еще ты хотел бы трахнуть меня?"
    MC "Да?"
    Caroline "Тебе явно нравится трахать мои груди и мою задницу. Что еще ты хотел бы сделать со мной?"

    scene CR2_AS2_p17

    MC "(Она серьезно задает этот вопрос прямо сейчас?)"
    MC "Ах .. Я бы хотел трахнуть тебя в рот."
    Caroline "Мой рот? Ммм ..."

    scene CR2_AS2_p18

    MC "И я бы хотел снять с тебя эти трусики и тереть член о твою мокрую киску."
    scene CR2_AS2_p18anim
    Caroline "(Ничего себе, я не знала, что он так влюблен в меня!)"
    scene CR2_AS2_p19anim
    Caroline "Продолжай..."

    scene CR2_AS2_p19

    MC "Затем, после движений, туда и обратно, я вставил бы член, глубоко в тебя."
    MC "Оооо…"
    Caroline "(От этих грязных разговоров я начинаю мокреть!)"

    scene CR2_AS2_p20

    MC "И тогда я бы вставлял, снова и снова в твою киску."
    MC "Каждый раз, заставляя тебя стонать и вздыхать от удовольствия."
    Caroline "Что дальше?"

    scene CR2_AS2_p21

    MC "Я ... Эмм…"
    Caroline "Продолжай - закончи рассказ."
    MC "Mmm! Я точно не выяснил окончание."

    scene CR2_AS2_p22

    Caroline "Хорошо, позволь мне закончить твой рассказ. Закрой глаза и представь, что ты трахаешь мою киску."
    MC "О Боже…"
    Caroline "Чувствуешь мою плотную влажную вагину, зажатую вокруг твоего члена?"

    scene CR2_AS2_p23

    Caroline "Я хочу, чтобы ты глубоко опустил и слил в меня горячее семя."
    MC "О, Боже, я собираюсь кончать!"
    Caroline "Да ... сперма внутри моей киски."
    Caroline "У тебя нет презерватива. Это опасно, но ты не должен сдерживать себя."

    scene CR2_AS2_p23a

    MC "Хннннггг! Ааахххх!"
    MC "Тьфу! Ааа! Ааа! Блядь!"
    Caroline "Да! Кончи в меня! Сперма глубоко в моем влагалище!"
    MC "Ой! Оооо…."
    Caroline "Вау! Ты ДЕЙСТВИТЕЛЬНО наслаждался моей задницей, разве не так?"
    $ renpy.music.stop(channel="music1", fadeout=1)
    $ renpy.music.play('/sfx/Sock Hop.mp3', channel="music2", loop=True, fadein = 2)
    $ can_hide_windows = False
    jump pc_icon_label
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
