


label MLR2_NS2_rep:
    scene MLR2_NS2_p1 with dissolve
    $ can_hide_windows = True
    MC "(Глоток…)"
    if renpy.loadable("patch.rpy"):
        MC "(Что ж, папа есть. Интересно, где мама.)"
    else:
        MC "(Что ж, Боб есть. Интересно, где Линда.)"
    MC "(Господи, мое сердце сейчас выскочит. Если он проснется и поймает меня - я ооочень пострадаю.)"

    scene MLR2_NS2_p2

    $ renpy.music.stop(channel="music1", fadeout=1)
    $ renpy.music.play('/sfx/Miami Viceroy.mp3', channel="music2", loop=True, fadein = 2)

    Mom "Привет, милый!"
    MC "Ах."
    Mom "Тише! Тише! "

    scene MLR2_NS2_p3

    Mom "Ты должен молчать, или мы разбудим старика."
    MC "Ладно. Ты напугала меня до усрачки!"
    MC "Не могла бы ты просто лежать на кровати, ожидая меня? "

    scene MLR2_NS2_p4

    Mom "Я не хотела уснуть и пропустить твой визит."
    if renpy.loadable("patch.rpy"):
        Mom "Кроме того, если бы я легла в постель, твой отец хотел бы снова заняться со мной сексом."
    else:
        Mom "Кроме того, если бы я легла в постель, Боб хотел бы снова заняться со мной сексом."
    Mom "Я просто потратила время, разбираясь с одеждой, пока он не ушел спать."

    scene MLR2_NS2_p5

    MC "А, понятно. Только в следующий раз ты могла бы нажать на мое плечо или шепнуть мое имя?"
    Mom "Ой, где тут веселье?"
    MC "(Вздох)"
    Mom "Теперь ... о том обещании, которое я дала…"

    scene MLR2_NS2_p6
    if renpy.loadable("patch.rpy"):
        Mom "Я говорила тебе, что буду держать своего скучного мужа подальше от тебя и не причиню тебе вреда."
    else:
        Mom "Я говорила тебе, что буду держать Боба подальше от тебя и не причиню тебе вреда."
    Mom "Однако-я хочу что-то взамен."
    if renpy.loadable("patch.rpy"):
        MC "Конечно, Мама. О чем ты думаешь?"
    else:

        MC "Конечно, Линда. О чем ты думаешь?"

    scene MLR2_NS2_p8

    Mom "Я хочу, чтобы ты доставил мне удовольствие, которое не может старик."
    Mom "Ты можешь делать все, что хочешь - но сосредоточься на моем удовольствии, а не своем."
    Mom "Ты понял?"
    if renpy.loadable("patch.rpy"):
        MC "Да, без проблем, мама."
    else:
        MC "Да, нет проблем, Линда."
    Mom "Прекрасно! Позвольте мне просто раздеться здесь."
    scene black
    $ renpy.pause(2, hard = True)
    scene MLR2_NS2_p9

    MC "(Ой! Она такая рячая!)"
    Mom "Продолжим."
    MC "Проберемся тайком в мою комнату?"
    Mom "Зачем нам это делать?"
    if renpy.loadable("patch.rpy"):
        MC "Потому что папа буквально спит, прямо рядом с тобой."
    else:
        MC "Потому что Боб буквально спит, прямо рядом с тобой."
    Dad "(Snooooreeee)"
    Mom "Но это половина веселья, милый!"

    scene MLR2_NS2_p10

    Mom "А теперь, как насчет того, чтобы ты пришел сюда и начал играть с моими сиськами, пока я тоже не уснула."
    if renpy.loadable("patch.rpy"):
        MC "(Я думаю, мама немного эксгибиционистка!)"
        MC "Конечно, Мама!"
    else:
        MC "(Я думаю, Линда немного эксгибиционистка!)"
        MC "Конечно, Линда!"

    scene MLR2_NS2_p11

    MC "(Mwah!)"
    Mom "Ooooхх…."
    scene MLR2_NS2_p11anim
    MC "(Сосет Сосет)"
    Mom "Aхх…"

    scene MLR2_NS2_p12

    Mom "Mмм… Сильнее… Да!"
    MC "(Сосет Сосет!)"
    scene MLR2_NS2_p12anim
    Mom "MMMM!!!"
    Dad "(Snooorrreeee)"

    scene MLR2_NS2_p13

    Mom "Eeek…."
    Mom "Aх… Aх… Aх..."
    Mom "Не останавливайся. Не останавливайся..."
    Mom "Черт, это хорошо."

    scene MLR2_NS2_p11

    Mom "Фу... Хорошо... Все, довольно."

    scene MLR2_NS2_p14

    Mom "Планы поменялись..."
    Mom "Мне нужно, чтобы ты спустился к моей киске, прямо сейчас."

    scene MLR2_NS2_p15

    Mom "Mмм… вот так. Поторопись!"
    Mom "Я сейчас мокрая. Мне нужно почувствовать твой язык внутри меня!"
    if renpy.loadable("patch.rpy"):
        MC "Тише - осторожно, не разбуди папу!"
    else:
        MC "Тихо - осторожны не разбуди Боба!"
    Mom "Mмм... Да пошёл он!"

    scene MLR2_NS2_p16

    Mom "Боже, мне так жарко. Пожалуйста, начинай сосать мой клитор. Мне нужно почувствовать, твой горячий мокрый рот!"
    MC "(Вау, она действительно не может держаться!)"
    MC "Ладно, держись! Просто старайся молчать."

    scene MLR2_NS2_p17

    MC "(Давай начнем...)"
    scene MLR2_NS2_p17anim
    MC "(Там наверху ее клитор. Я могу либо сосредоточиться на этом, либо вставить палец внутрь и найти ее точку g.)"
    MC "(Начнем с точки g.)"

    scene MLR2_NS2_p18

    Mom "Oooх….. Mмм!"
    scene MLR2_NS2_p18anim
    Mom "Да... Да, [player_name]. я люблю тебя!"
    MC "(Похоже, я сделал хороший выбор-она действительно наслаждается этим!)"
    Mom "Глубже!"

    scene MLR2_NS2_p19

    Mom "OOOхххх!"
    MC "Тише! Не разбуди."
    Mom "Возбуди мою распутную киску! ААА! АХХХХ!"
    MC "(Черт, она сейчас такая громкая!)"

    scene MLR2_NS2_p20

    Mom "О, да! Заставь меня кончить!"
    Dad "(Храп…)"
    if renpy.loadable("patch.rpy"):
        MC "(Слава Богу, папа крепко спит!)"
    else:
        MC "(Слава Богу, Боб крепко спит!)"
    Dad "ЗЕВОК!"

    scene MLR2_NS2_p21

    MC "Вот дерьмо..."
    Mom "(Блядь…)"
    Dad "(Храп…)"
    MC "Хух…"
    Mom "(Я думала, он проснется!)"

    scene MLR2_NS2_p22

    Mom "Разве я не говорила тебе работать языком??"
    MC "Да, но..."
    Mom "Тащи свое лицо, прижимайся к моим бедрам, прямо сейчас!"

    scene MLR2_NS2_p23

    Mom "Быстрее! Я скоро кончу!"
    if renpy.loadable("patch.rpy"):
        Mom "Мне нужно чувствовать, что язык моего сына извивается и щелкает глубоко внутри моей киски!"
        MC "(Вот так ... давайте дадим маме лучший Кунилингус, который у нее когда-либо был!)"
    else:
        Mom "Мне нужно чувствовать, что [player_name] корчится языком и щелкает-глубоко внутри моей киски!"
        MC "(Вот так ... давайте дадим Линде лучший Куннилингус, который у нее когда-либо был!)"

    scene MLR2_NS2_p24

    Mom "Ааа! Да!"
    scene MLR2_NS2_p24anim
    MC "(Лижет! Slurp!)"
    scene MLR2_NS2_p26anim
    Mom "Прямо там! Не останавливайся! Ах!"

    scene MLR2_NS2_p25

    MC "(Suck! Lick! Shlurp!)"
    Mom "AHHH! Святой трах! Ааа! Мммм!"
    Mom "О Боже! О Боже! Да! Не останавливайся!"

    scene MLR2_NS2_p26

    Mom "Глубже! Сильнее!"
    Dad "(Храп…)"
    MC "(Она прижимает мою голову!)"


    scene MLR2_NS2_p26a

    Mom "Ой! Ой! ой!"
    MC "(Ее дыхание стало ДЕЙСТВИТЕЛЬНО быстрым! Похоже, она на подходе!)"
    MC "(Лижет! Лижет! Лижет!)"

    scene MLR2_NS2_p27

    Mom "Oххххх дааааааааа! Кончааааююю! Eek!"
    Mom "Aххххххх! Oooххххх!"
    if renpy.loadable("patch.rpy"):
        Mom "(Горячий влажный язык моего сына заставляет меня кончить!)"
    else:
        Mom "([player_name] с горячим влажным языком заставил меня кончить!)"
    Mom "Хмммммм!!! Aaaххххххх!"

    scene MLR2_NS2_p28

    Mom "(Пыхтит…)"
    Mom "(Задышка…)"
    Dad "(Snooorreeee…)"
    MC "(Лижет!)"
    Mom "Подожди... я - аааа - кончаю!"
    MC "(Лижет Лижет Лижет!)"

    scene MLR2_NS2_p29

    Mom "(О Боже! Это ооочень чувствительно! Почему он не останавливается?!)"
    scene MLR2_NS2_p29anim
    Mom "MMMMMM!!!!!"
    Mom "(Он чувствует себя так хорошо!)"

    scene MLR2_NS2_p30

    Mom "MMMM! MMMMMPPFFFFFF!!!"
    MC "(Лижет Лижет Лижет!)"
    window hide
    scene MLR2_NS2_p30anim
    $ renpy.pause(7,hard = True)
    scene MLR2_NS2_p30a
    MC "(Я думаю, что я заставлю ее кончить, во второй раз!)"
    if renpy.loadable("patch.rpy"):
        MC "(Черт, она извивается и трепещет по всей кровати! Я удивлен, что папа не проснулся!)"
    else:
        MC "(Черт, она извивается и трепещет по всей кровати! Я удивлен, что Боб не проснулся!)"


    scene MLR2_NS2_p31

    Mom "Черт возьми ... это было потрясающе."
    Mom "Где ты научился так делать?"
    MC "Честно? Это первый раз, когда я когда-либо делал куни."

    scene MLR2_NS2_p32

    Mom "Mмм..."
    MC "Хех! Я так полагаю."
    Mom "Этот второй был лучшим оргазмом, который я когда-либо чувствовала в своей жизни."
    Mom "Я тебя люблю."

    scene MLR2_NS2_p33

    Mom "Mмм…"
    MC "Mмм!"

    scene MLR2_NS2_p34

    MC "(Был ли я действительно настолько хорош в оральном сексе? Я не понял!)"
    MC "(Мне придется запомнить это, в будущем, для других девушек.)"
    Mom "Mмм…"
    if renpy.loadable("patch.rpy"):
        MC "(Надеюсь, когда-нибудь я смогу трахнуть маму. Не могу дождаться этого.)"
    else:
        MC "(Надеюсь, когда-нибудь я смогу трахнуть Линду. Не могу дождаться этого.)"
    $ renpy.music.stop(channel="music1", fadeout=1)
    $ renpy.music.play('/sfx/Sock Hop.mp3', channel="music2", loop=True, fadein = 2)
    $ can_hide_windows = False
    jump pc_icon_label
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
