

label SR2_NS2_rep:
    hide screen week_day_viewer
    hide screen time_skip_button
    hide screen day_time_viewer
    hide screen map_button
    $ renpy.music.stop(channel="music2", fadeout=1)
    $ renpy.music.play('/sfx/Chill Wave.mp3', channel="music1", loop=True, fadein = 2)
    $ can_hide_windows = True

    scene SR2_NS2_p1 with dissolve

    MC "Эй, Сара! Я рада, что ты пришла."
    Sara "Да... я не собираюсь врать ... я немного нервничала с тех пор, как ты рассказал мне о вибраторе."
    MC "О, ты передумала??"
    Sara "Я ... Я не уверена ... может быть. Я просто представляю, что это такая массивная, черная, толстая, страшная вещь…"

    scene SR2_NS2_p2

    MC "Как насчет этого?"
    Sara "О, Боже мой! Он такой милый! И розовый! "
    MC "Оно?"
    Sara "Теперь ‘оно’!"
    MC "Ну? Как насчет того, чтобы попробовать ‘его’ сейчас?"

    scene SR2_NS2_p3

    Sara "Может сначала я тебе сделаю кое что? Мне нужно ‘разогреться’."
    Sara "Помогу тебе достичь цели."
    MC "Ну, если ты уверена!"

    scene SR2_NS2_p4

    Sara "Помоги мне снять лифчик."
    MC "(О черт... эти вещи-чертов кошмар, пока снимешь!)"
    MC "(Может быть, я просто стяну его с ее плеч?)"

    scene SR2_NS2_p5

    MC "(Ага! Это работает! Я боялся, что пройдут века, пока я возился с этой проклятой застежкой!)"
    Sara "(Почему он его не отцепил? Разве он не знает, как снять лифчик?)"
    Sara "[player_name]?"

    scene SR2_NS2_p6

    MC "Да, Сара?"
    Sara "Почему ты так снимаешь с меня лифчик? Ты можешь расстегнуть его, верно?"
    MC "(Черт, она на меня набросилась.!)"
    MC "Да! Я думал, так будет ... сексуальнее!"


    scene SR2_NS2_p7

    Sara "О, это очень мило. Хехе…"
    Sara "Итак, ты выбираешь первый, [player_name]. Что бы ты хотел, чтобы я сделала?"
    Sara "Я могу отсосать тебе, или сделать что-то еще, если у тебя есть идеи?"
    Sara "Я все еще не чувствую себя готовой к сексу."

    menu:
        "Сделаешь мне нинет, Сара?":


            $ renpy.music.stop(channel="music1", fadeout=1)
            $ renpy.music.play('/sfx/Miami Viceroy.mp3', channel="music2", loop=True, fadein = 2)

            MC "Ты отлично сосешь. Могу я попросить тебя еще один раз??"
            Sara "Конечно, [player_name]! Ложись на кровать!"


            scene SR2_NS2_blow_p1
            Sara "На этот раз я постараюсь еще сильнее!"
            MC "(Это будет здорово!)"
            Sara "Надеюсь, ты готов!"


            scene SR2_NS2_blow_p2

            Sara "Ooх..."
            Sara "(Вау! Он уже такой твердый…)"
            Sara "(Я забыла, как толстый и большой его член…)"

            scene SR2_NS2_blow_p3

            MC "Смотри, то что тебе нравится, Сара?"
            Sara "Ах ... Это так ... большой. И ты уже возбудился!"
            MC "Конечно! Я должен видеть твои сиськи, в конце концов!"

            scene SR2_NS2_blow_p4

            Sara "Да, я так думаю."
            Sara "Какое чувство, когда я касаюсь кончика пальцем, как сйчас?"
            MC "Ммм ... Действительно чувствительно."
            Sara "В хорошем смысле?"
            MC "Да, в хорошем смысле."
            Sara "Так что, было бы лучше, если бы я использовала язык, чтобы лизать кончик?"
            MC "Оооо, да..."

            scene SR2_NS2_blow_p5

            Sara "*Лижет*"
            MC "А ... это хорошо, Сара."
            MC "(Черт, это невероятно. Она так медленно проводит язык по моей головке.)"

            scene SR2_NS2_blow_p6

            Sara "(Я чувствую, как его член дергается под моим языком. Он должно быть наслаждается этим!)"
            Sara "(И это похоже на то, что предсемя уже просачивается.)"
            Sara "(Интересно, как долго я могу лизать его член, прежде чем он начнет умолять сосать его?)"
            Sara "*Лижет Лижет*"
            MC "Aх..."

            scene SR2_NS2_blow_p7

            MC "(Черт, она дразнит меня языком!)"
            Sara "*Лижет Лижет Лижет*"
            MC "Ебать... Ммм! Может начнешь сосать?"

            scene SR2_NS2_blow_p8

            Sara "(Хехе! Не долго, кажется!)"
            Sara "*Shlluuurrrrp*"
            MC "Aхх… Боже"
            MC "(Ее рот такой горячий и влажный!)"

            scene SR2_NS2_blow_p9

            MC "Это было потрясающе, Сара. Ми можем сменить позицию?"
            Sara "Что мне нужно сделать?"
            MC "Просто ляг лицом вниз на кровать. Я буду стоять в конце."
            Sara "Хорошо."

            scene SR2_NS2_blow_p10

            Sara "Так нормально?"
            MC "Отлично."
            Sara "Почему ты хочешь поменяться местами?"

            scene SR2_NS2_blow_p11

            MC "Так я смогу вставлять член в рот."
            Sara "Вставлять?!"
            MC "Не волнуйся - тебе не прийдеться двигать головой. Я обещаю."
            Sara "Я ду..."

            scene SR2_NS2_blow_p12

            Sara "ПФФФ!"
            scene SR2_NS2_blow_p12anim
            MC "Оооо, хорошо."
            Sara "(Его член, такой толстый и длинный! Я ни за что не смогу взять больше половины в рот.!)"

            scene SR2_NS2_blow_p13

            MC "МММ ... Бля…"
            Sara "*Shluurrrrp*"
            Sara "*Сосет Сосет*"

            scene SR2_NS2_blow_p14

            Sara "Mppffff!"
            Sara "*Сосет Сосет*"
            scene SR2_NS2_blow_p14anim
            MC "(Чувство ее губ, обернутых вокруг моего члена, невероятно хорошо!)"

            scene SR2_NS2_blow_p15

            MC "(Я больше не могу этого выносить! Я должен пройти глубже!)"
            MC "(Я надеюсь, что она не будет возражать, если я положу руки на ее голову и вставлю член, дальше в рот…)"
            Sara "Хмм?!"

            scene SR2_NS2_blow_p16

            Sara "ПФФФ…"
            scene SR2_NS2_blow_p16anim
            Sara "(Что он хочет сделать?)"
            Sara "(Конечно, он не собирается...)"

            scene SR2_NS2_blow_p17

            Sara "MPPFF!!"
            Sara "*SHLURRRRRP!*"
            MC "Aххххх!"
            MC "(Я чувствую первые пару сантиметров моего члена скользят по мокрому горлу!)"

            scene SR2_NS2_blow_p18

            MC "(Черт, это потрясающе! Я должен сделать это снова.)"
            scene SR2_NS2_blow_p18anim
            Sara "*GAG!*"
            Sara "*Сосет Сосет*"

            scene SR2_NS2_blow_p19

            Sara "*GAG!*"
            Sara "*SHLURRRRRP!*"
            scene SR2_NS2_blow_p19anim
            MC "(Так прикольно! Я чувствую, как он хватается за мой член каждый раз, когда у нее рвотный рефлекс!)"
            MC "Хммм! Черт! Я собираюсь кончить!"
            Sara "(Поcтой - он собирается кончить мне в рот!?)"
            scene white with dissolve
            $ renpy.pause(0.7, hard = True)
            scene SR2_NS2_blow_p19 with dissolve
            $ renpy.pause(0.7, hard = True)
            scene white with dissolve
            $ renpy.pause(0.7, hard = True)
            scene SR2_NS2_blow_p20 with dissolve

            MC "Хмммм! О, да! Черт! ААА…"
            MC "Прямо туда! Да! Тьфу!"
            Sara "(Здесь столько всего! Я могу попробовать его соленую сперму, заливающую мой язык!)"

            scene SR2_NS2_blow_p21

            MC "Это было потрясающе, Сара… *Пыхтит*"
            Sara "(Должна ли я проглотить его снова, как в прошлый раз?)"
            Sara "(Я думаю, это действительно сделает его счастливым.)"

            scene SR2_NS2_blow_p22

            MC "Все в порядке, Сара.?"
            MC "О! Тебе нужна, салфетка, чтобы сплюнуть?"
            Sara "(Там так много..., но это сделает его таким счастливым, если я могу проглотить.)"

            scene SR2_NS2_blow_p23

            MC "Сара, тебе не нужно пробовать ее проглотить. Позволь мне принести салфетку, и ты може..."
            Sara "*ГЛОТОК*"
            MC "Хм?"

            scene SR2_NS2_blow_p24

            Sara "Aaaah…."
            Sara "Все ушло. Хехе…"
            Sara "Извините, было так много, что было трудно глотать. Так же, когда глотаешь слишком много напитка за один раз."
            MC "Ха, я знаю. Спасибо, Сара. Минет был невероятным."
            Sara "Я рада, что тебе понравилось."

            menu:
                "Поцеловать ее.":
                    scene SR2_NS2_blow_p24a

                    Sara "Mwah!"
                    MC "Mмм…"
                    Sara "(Я так сильно тебя люблю, [player_name]… Ты лучшее, что когда-либо случится в моей жизни.)"
                    jump SR2_NS2_continue_rep
                "Продолжить.":
                    jump SR2_NS2_continue_rep
        "Ты знаешь, как подарить ему ласку, Сара?":

            $ renpy.music.stop(channel="music1", fadeout=1)
            $ renpy.music.play('/sfx/Miami Viceroy.mp3', channel="music2", loop=True, fadein = 2)

            scene SR2_NS2_p7

            MC "Как насчет того, чтобы мы попробовали футджоб? Ты знаешь как надо?"
            Sara "Футджоб? Моими ногами?"
            MC "Да."
            Sara "Я ... думаю, я смогу это исправить - но мог бы ты показать?"
            MC "Конечно. Ложись лицом вверх, на кровати с раздвинутыми ногами."

            scene SR2_NS2_foot_p1

            Sara "Так?"
            MC "Это прекрасно, Сара. Я покажу что делать дальше."
            MC "(Ее грудь безупречна! Кроме того, отсюда их видно намного лучше.)"

            scene SR2_NS2_foot_p2

            MC "Хорошо, подними ноги к моему члену и попробуй массировать его."
            Sara "Хорошо, [player_name]."
            scene SR2_NS2_foot_p2anim
            MC "Ты должна быть осторожна - ноги немного неуклюже рук, поэтому старайтесь не использовать слишком много силы; или ты можешь навредить мне."
            Sara "Я буду осторожна!"

            scene SR2_NS2_foot_p3

            Sara "Нормально, [player_name]? Достаточно нежно?"
            MC "Да, это действительно хорошо для первой попытки, Сара. Ты делаешь большие успехи."
            MC "(Ее ноги, так мило!)"
            MC "Можешь разместить ноги, по обе стороны моего члена и перемещать их туда и обратно?"

            scene SR2_NS2_foot_p4

            Sara "Так, как сейчас?"
            scene SR2_NS2_foot_p4anim
            MC "Да, вот так. Ммм…"
            Sara "Как чувство?"

            scene SR2_NS2_foot_p5

            MC "ААА... Это... вроде как мастурбация, но ногами, как  по мне, то это гораздо более эротично."
            Sara "Действительно? Вау…"
            MC "Mмм!"
            Sara "Мне начать быстрее?"

            scene SR2_NS2_foot_p6

            MC "Нормально и так."
            Sara "Это кажется странным, но я рада, что тебе нравится."
            Sara "Как насчет того, если я попробую что-то вроде... этого!"

            scene SR2_NS2_foot_p7

            MC "Oхх! Mмм!"
            scene SR2_NS2_foot_p7anim
            Sara "Хехе! Это звучит так, как будто это сработало хорошо!"
            Sara "(Его член дергается по моей стопе! Это должно быть очень чувствительно!)"

            scene SR2_NS2_foot_p8

            MC "Охх! Ах ... Бля…"
            MC "(Черт, это так возбуждает! Я бы хотел просто сорвать с нее трусики и трахнуть ее прямо сейчас!)"

            scene SR2_NS2_foot_p9

            MC "(Я бы просто наклонился вперед, схватил эластичный пояс снял бы его.)"
            MC "(Затем я бы погрузил свой член в ее мокрую киску.)"
            MC "(Она не смогла бы устоять перед удовольствием, как только мой член был оказался глубоко внутри нее.)"

            scene SR2_NS2_foot_p10

            MC "(Это выглядит так привлекательно... но я должен сдерживаться. Она сказала, что еще не готова к этому…)"
            Sara "Ты в порядке, [player_name]? Почемц ты затих?"
            MC "Да, я просто наслаждаюсь."

            scene SR2_NS2_foot_p11

            Sara "Ты смотришь на мои трусики?"
            Sara "Ты действительно хочешь трахнуть меня ... не так ли?"
            MC "Ах…"

            scene SR2_NS2_foot_p12

            Sara "[player_name]? Ты хочешь трахнуть меня?"
            MC "…"
            MC "(Черт возьми! Я не могу больше сопротивляться. Мне придется кончить быстро!)"

            scene SR2_NS2_foot_p13

            Sara "Eek!"
            MC "Двигай ногами быстрее, Сара!"
            scene SR2_NS2_foot_p13anim
            MC "Потри мой член, так быстро, как можешь!"

            scene SR2_NS2_foot_p14

            Sara "*Пыхтит* Да! Ах ... Ах…"
            MC "МММ! Да! Так! Ах…"
            MC "(Черт возьми, я хочу чувствовать свой член внутри ее тела.)"

            scene SR2_NS2_foot_p15

            MC "Да! AХХ! Блядь!"
            MC "Я скоро кончу, Сара!"
            Sara "*Пыхтит Пыхтит*"

            scene SR2_NS2_foot_p16

            MC "Мммм! Ахххх!!!"
            MC "Ugh! Hnng!!!"
            scene white with dissolve
            $ renpy.pause(0.7, hard = True)
            scene SR2_NS2_foot_p16 with dissolve
            $ renpy.pause(0.7, hard = True)
            scene white with dissolve
            $ renpy.pause(0.7, hard = True)
            scene SR2_NS2_foot_p16a with dissolve
            Sara "(Вау! Он скоро!)"

            scene SR2_NS2_foot_p17

            MC "Фу ... Это было ... чертовски удивительно, Сарa…"
            Sara "Хе-хе ... Тебе понравилось?"
            MC "Это было невероятно…"
            MC "Но у тебя еще не было оргазма. Позволь мне взять вибратор, и мы начнем."

            jump SR2_NS2_continue_rep

label SR2_NS2_continue_rep:
    $ renpy.music.stop(channel="music1", fadeout=1)
    $ renpy.music.play('/sfx/Niles_Blues.mp3', channel="music2", loop=True, fadein = 2)
    scene SR2_NS2_p8

    MC "Большое спасибо, Сара. Это было совершенно потрясающе."
    Sara "Я очень рада, что тебе понравилось.."
    MC "Теперь твоя очередь. Посмотрим, смогу ли я сделать тебя такой же счастливой, как ты сделала меня."

    scene SR2_NS2_p9

    MC "Мне нужно снять твои трусики."
    Sara "Ладно… *Глоток*"
    MC "(Она все еще немного нервничает. Возможно, она просто стесняется?)"

    scene SR2_NS2_p10

    MC "Вот так..."
    MC "Если тебе это неудобно, Сара. Просто дайте мне знать, хорошо?"
    Sara "Хорошо…"

    scene SR2_NS2_p11

    MC "(Ее дыхание становится намного быстрее. Я должен быть осторожен, чтобы не тянуть это слишком долго. Я не хочу, чтобы она стеснялась и отступала.)"
    Sara "(Он снова увидит мою киску… Что будет, когда он приложит вибратор к ней?)"
    Sara "(Я буду дрожать и дрожать, как он, когда кончает?)"

    scene SR2_NS2_p12

    Sara "(Надеюсь, я не стону так громко, как [player_name]. Было бы так стыдно…)"
    MC "Продолжим."
    MC "Твоя киска выглядит так красиво, Сара."

    scene SR2_NS2_p13

    Sara "Aххх… Не смотри на нее!"
    MC "Да ладно. Это великолепно. Чего ты стесняешься?"
    MC "Неловко, когда ты смотришь на него!"

    scene SR2_NS2_p14

    MC "Сара, расслабься. Тут нечего стесняться. У тебя одно из самых сексуальных тел, что я когда-либо видел."
    Sara "Точно? Ты говоришь правду?"
    MC "Да. Теперь откинься назад - настала моя очередь, чтобы ты чувствовала себя хорошо."

    scene SR2_NS2_p15

    MC "Мне нужно, чтобы ты раздвинула ноги немного, чтобы я мог прикрепить вибратор красиво и близко."
    Sara "О-о, прости. Сейчас."

    scene SR2_NS2_p16

    Sara "Я... это нормально?"
    MC "Это прекрасно. Просто ложись, расслабься и наслаждайся этим. Окей?"
    Sara "Ладно…"

    scene SR2_NS2_p17

    MC "Я начну с легкого массажа твоей киски. Если это слишком чувствительно или больно, просто скажи, и я немедленно остановлюсь. Окей?"
    Sara "Ладно, [player_name]."
    Sara "Mмм..."

    scene SR2_NS2_p18

    Sara "Aх…"
    Sara "(Он может видеть внутри меня прямо сейчас!)"
    Sara "(Что, если ему не нравится, как я выгляжу, и он больше не хочет ‘встречаться’ со мной...)"
    MC "Ты прекрасна, Сара."

    scene SR2_NS2_p19

    Sara "Oooхх…"
    MC "Я просто использую пальцы, чтобы проверить, достаточно ли ты мокрая."
    Sara "Aххх…. Mммммм…"

    scene SR2_NS2_p20

    MC "Хорошо, это прекрасно. Теперь я включу вибратор и начну его использовать."
    MC "Если ты испугаешься или захочешь, чтобы я прекратил, просто дай мне знать, хорошо?"
    Sara "Я ... Я буду, [player_name]."

    scene SR2_NS2_p21

    MC "Я так сильно тебя люблю. Я не собираюсь делать ничего, что причинит тебе боль. Я обещаю."
    Sara "*Глоток* Спасибо, [player_name]. Извини, что так... страшно."
    MC "Тебе не нужно извиняться."

    scene SR2_NS2_p22

    MC "Вот так. Я просто нажму маленькую кнопку здесь и…"
    "*Buzzzzz*"
    Sara "Eek!"
    MC "Не бойся этого шума."

    scene SR2_NS2_p23

    Sara "МММ! Ах... Охх…."
    MC "(Похоже, ей это нравится.!)"
    MC "(Я надеюсь, что продавщица была права, когда сказала мне купить самый мощный вибратор, который у них был в магазине!)"

    scene SR2_NS2_p24

    Sara "О... ОООХХХ!"
    Sara "(Это кажется таким ... странным! Как будто мой клитор горит! ААА…)"
    Sara "Aхх! Aххх!"
    "*BUZZ*"

    scene SR2_NS2_p25

    MC "Как дела, Сара?"
    Sara "Это - ах -ооочень интенсивно!"
    MC "В хорошем смысле?"
    Sara "Я - аааа - не ммммммм!"

    scene SR2_NS2_p26

    Sara "AХХ! AХХХ! MMMMM! OOOХХХХ!"
    Sara "Остановись! Ох! ОСТАНОВИТЬ!"
    MC "(Ох, что-то не так?)"

    scene SR2_NS2_p27

    MC "Ты в порядке, Сара?"
    Sara "Да ... * Пыхтение* это было просто ... так интенсивно ... * вздох*"
    MC "Ты кончила?"
    Sara "Я... не знаю? У меня никогда не было оргазма…"
    MC "Ты хочешь чтобы я остановился?"
    Sara "Мы могли бы просто обниматься?"

    scene SR2_NS2_p28

    MC "Конечно, можем. Положи голову мне на грудь.."
    Sara "Спасибо, [player_name]. Извините, я не достаточно хороша в этом."
    MC "Ты прекрасна, Сара. Это займет некоторое время, чтобы привыкнуть ко всему этому."

    scene SR2_NS2_p29

    MC "Я оставлю вибратор с тобой. Ты можешь попробовать его самостоятельно, в любое время."
    MC "Просто выбери свой собственный темп, с которым тебе будет удобно."
    Sara "Ты уверен?"

    scene SR2_NS2_p30

    MC "Конечно, Сара. Вот держите его, и мы вместе сделаем первые шаги."
    if renpy.loadable("patch.rpy"):
        Sara "Огромное спасибо, [player_name]. Мне так повезло, что ты мой брат."
    else:
        Sara "Огромное спасибо, [player_name]. Мне так повезло, что ты мой друг."
    MC "Спокойной ночи, Сара."
    if renpy.loadable("patch.rpy"):
        Sara "Я люблю тебя, [player_name]. Я лучше прокрадусь обратно в свою комнату, прежде чем засну, и мама поймает меня утром!"
    else:
        Sara "Я люблю тебя, [player_name]. Я лучше вернусь в свою комнату, прежде чем засну, а Линда поймает меня утром!"
    MC "Я тоже тебя люблю, Сара. Увидимся завтра."
    $ renpy.music.stop(channel="music1", fadeout=1)
    $ renpy.music.play('/sfx/Sock Hop.mp3', channel="music2", loop=True, fadein = 2)
    $ can_hide_windows = False
    jump pc_icon_label
# Decompiled by unrpyc: https://github.com/CensoredUsername/unrpyc
